
#####################################################################################
# 이진수
T = int(input())
for tc in range(1, T+1):
    N, M = map(int, input().split())

    mask = (1 << N) - 1   # 하위 N비트가 모두 1인 수

    # (1 << N)      = 1 000...0   (뒤에 0이 N개)
    # (1 << N) - 1  = 0 111...1   (뒤에 1이 N개)

    if M & mask == mask:  # M의 마지막 N비트가 전부 1인가?
    # M      = 0b010111
    # mask   = 0b000111
    # M&mask = 0b000111  → 7


        print(f"#{tc} ON")
    else:
        print(f"#{tc} OFF")

#####################################################################################
